<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
  <title>Hilfe Bearbeiten einer Liga</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" href="../media/lmo.css" type="text/css">
<script type="text/javascript">
</script>
</head>
<body>
  <div id="container">
    <div id="header">
      <div id="banner">
        <a href="http://www.liga-manager-online.de/"><img src="../media/trans.gif" alt="" width="100%" height="160"></a>
      </div>
      <div id="back"></div>
      <div id="urhere"></div>
    </div>
    <div id="navi">
      <ul>
        <li id="flags"></li>
      </ul>
      <div class="navigation">
        <ul>
          <li>
            <a class="active" href="index.html">Hilfe</a>
            <ul>
              <li><a class="page" href="einstiegsinformationen.html">Einstiegsinformationen</a></li>
              <li><a class="page" href="optionen.html">Optionen</a></li>
              <li><a class="active" href="bearbeiten_einer_liga.html">Bearbeiten einer Liga</a></li>
              <li><a class="page" href="dateifunktionen.html">Dateifunktionen</a></li>
              <li><a class="page" href="anpassung_des_lmo.html">Anpassung des LMO</a></li>
            </ul>
          </li>
          <li><a class="folder" href="addons/index.html">Addons</a></li>
        </ul>
      </div>
    </div>
    <div id="content">
      <a name="top" id="top"></a>
      <h1>Bearbeiten einer Liga</h1>
      <ol type="1">
        <li><a href="#1">Erstellen einer Liga</a></li>
        <li><a href="#2">Öffnen einer Liga</a></li>
        <li><a href="#3">Der Ergebniseditor</a></li>
        <li><a href="#4">Grundeinstellungen</a></li>
        <li><a href="#5">Manuelle Tabellensortierungs</a></li>
        <li><a href="#6">Der Mannschaftseditor</a></li>
      </ol>
      <h3><a name="1">1. Erstellen einer Liga</a></h3>
      <p>Klicken Sie im Men&#252; auf <strong>Neu</strong>, um eine neue Liga zu erstellen. Der Erstellungsproze&#223; umfa&#223;t 4
      Schritte:</p>
      <p>Zuerst legen Sie den <strong>Dateinamen</strong> der Liga fest. Verzichten Sie dabei auf den Pfad und die Namenserweiterung, diese
      sind bereits vorgegeben. Achten Sie darauf, da&#223; Ihre Eingabe max. 28 Zeichen lang sein darf. Geben Sie der Liga nun einen
      aussagekr&#228;ftigen <strong>Namen</strong>. Dieser Titel erscheint in den Auflistungen Ihrer Ligen und als &#220;berschrift im
      Besucher-Bereich. Neben dem Titel selbst und ggf. regionale Angaben sollte hier auch die Saison erw&#228;hnt werden, z.B. <kbd>1.
      Kreisklasse Hinterwelt 2001/02</kbd>. Legen Sie nun noch fest, ob Sie eine <strong>Liga</strong> (mit Punkten, Tabelle usw.) oder ein
      <strong>KO-Turnier</strong> (PlayOff, Turnier o.&#228;.) anlegen. Klicken Sie auf <strong>Weiter</strong> , um fortzufahren.</p>
      <p>Als N&#228;chstes legen Sie die <strong>Anzahl der Mannschaften</strong> fest. Erstellen Sie eine Liga, legen Sie bitte auch die
      <strong>Anzahl der Spieltage</strong> und die <strong>Anzahl der Spiele pro Spieltag</strong> fest. Bei KO-Turnieren ist das nicht
      notwendig, da diese Einstellungen hier schon durch die Anzahl der Mannschaften bestimmt wird. Klicken Sie auf
      <strong>Weiter</strong>, um fortzufahren.</p>
      <p>Der 3. Schritt ist bei Ligen die <strong>Spielplanerstellung</strong>. <strong>Spielpl&#228;ne aus anderen Ligen
      &#252;bernehmen</strong> funktioniert nur bei Ligen, die die gleichen Anzahlen an Mannschaften, Spielen und Spieltagen hat. Der
      <strong>zuf&#228;llige Spielplan</strong> entspricht dem aus dem LM98Free bekannten System; er kann nur dann erstellt werden, wenn es
      sich um eine 'normale' Liga handelt, in der jedes Team 1 Hin- und 1 R&#252;ckspiel gegen jeden Gegner hat (wie in der
      Fu&#223;ball-Bundesliga). Sie k&#246;nnen aber auch ganz auf die Spielplanerstellung verzichten.</p>
      <p>Bei KO-Turnieren legen Sie im 3. Schritt der Erstellung fest, welchen <strong>Spielmodus</strong> die einzelnen Runden Ihres
      Turniers haben sollen. Klicken Sie auf <strong>Weiter</strong>, um zum letzten Schritt zu gelangen.</p>
      <p>Die <strong>Liga wurde gespeichert</strong> und Sie sollten als N&#228;chstes die <a href="#6">Mannschaften</a> bearbeiten.
      Erstmal sind die Mannschaften nur durchnummeriert und Sie k&#246;nnen nun die Namen und alles weitere frei festlegen. Bei neuen
      Ligen, deren Spielpl&#228;ne Sie aus anderen Ligen &#252;bernommen haben, sollten Sie vorher einen Blick in den Besucherbereich
      werfen und anhand der Spielpl&#228;ne der einzelnen Mannschaften herausfinden, welche Mannschaft welchem Eintrag zugeordnet werden
      mu&#223;.</p><a href="#top">[nach oben]</a>
      <h3><a name="2">2. &#214;ffnen einer Liga</a></h3>
      <p>Wenn Sie sich in den Adminbereich <a href="einstiegsinformationen.html#4">eingeloggt</a> haben, erhalten Sie einen &#220;bersicht,
      in der auch alle verf&#252;gbaren Ligen aufgelistet sind. Sonst klicken Sie einfach im Men&#252; auf <strong>&#214;ffnen</strong>, um
      eine Auflistung der Ligen zu erhalten. W&#228;hlen Sie hier die Liga aus, die Sie bearbeiten m&#246;chten und klicken Sie sie an.
      <a href="optionen.html#optionen0401">Hilfs-Admins</a> k&#246;nnen nur die Ligen ausw&#228;hlen, die f&#252;r sie freigegeben
      wurden.</p>
      <p><a href="#top">[nach oben]</a></p>
      <h3><a name="3">3. Der Ergebniseditor</a></h3>
      <p>Nach dem <a href="#2">&#214;ffnen der Liga</a> gelangen Sie gleich automatisch in den Ergebniseditor und der aktuelle Spieltag
      wird dargestellt. In der Auswahl unterhalb des Men&#252;s k&#246;nnen Sie auch einen anderen Spieltag zum Bearbeiten
      ausw&#228;hlen.</p>
      <p>Ganz oben k&#246;nnen Sie das <strong>Start- und Enddatum</strong> des Spieltags festlegen. Achten Sie unbedingt darauf, das das
      Datum in der Form TT.MM.JJJJ (2stelliger Tag, 2stelliger Monat und 4stelliges Jahr durch Punkte getrennt) eingegeben werden mu&#223;.
      Neben den Datumsfeldern ist jeweils ein Button angebracht, der einen PopUp-Kalender &#246;ffnet, wo Sie durch Anklicken einfach ein
      Datum ausw&#228;hlen k&#246;nnen. Diese Datumswerte werden den Besuchern nur dann angezeigt, wenn die <a href="#4">Einstellung</a>
      <strong>Spieltagsdatum</strong> aktiviert.</p>
      <p>Jedem Spiel kann auch ein <strong>Ansto&#223;termin</strong> zugeordnet werden. Beachten Sie auch hier die Form TT.MM.JJJJ
      f&#252;r das Datum. Und auch hier gibt es einen Button f&#252;r den PopUp-Kalender. Wenn Sie ein Datum und keine Zeit eingeben, wird
      automatisch die <a href="optionen.html#1">Standard-Ansto&#223;zeit</a>&#160;&#252;bernommen. Geben Sie eine Zeit ein, achten Sie
      bitte auf die Form HH:MM (2stellige Stund und 2stellige Minute durch : getrennt).</p>
      <p>Die <strong>Mannschaften</strong> w&#228;hlen Sie einfach durch Klicks auf die Comboboxen aus.</p>
      <p>Bei der <strong>Ergebniseingabe</strong> haben Sie mehrere M&#246;glichkeiten. Am einfachsten ist es, Sie klicken ganz einfach auf
      die kleinen Pfeilbuttons neben den Ergebnisfeldern. Wenn Sie sich mit dem Textcursor in einem Ergebnisfeld befinden, k&#246;nnen sie
      auch mit den Pfeiltasten hoch und runter das Ergebnis &#228;ndern oder Sie tippen die Zahl ganz normal ein. Falls Sie die Option
      f&#252;r Nachkommastellen in den <a href="#4">Grundeinstellungen</a> aktiviert haben, geben Sie die Ergebnisse weiterhin als ganze
      Zahlen ein, die Umrechnung wird erst zur Ausgabe sichtbar.</p>
      <p>Falls Ihre Liga ein <a href="#4">offenes Spielende</a> hat oder ein KO-Turnier ist, geben Sie als N&#228;chstes an, wann das Spiel
      endete: Normal (_), nach Verl&#228;ngerung/Over time (n.V.) oder Im 11-Meter-/Penalty-Schie&#223;en (i.E.).</p>
      <p class="attention">Meistens werden in einer Sportgerichtsentscheidung sowohl Punkte als auch Tore ge&#228;ndert. (Also einer
      Mannschaft der Sieg aberkannt z.B.) In diesem Fall brauchen Sie die folgende Option nicht zu benutzen!</p>
      <p class="advanced">Das Feld <strong>Gr&#252;ne-Tisch-Entsch.</strong> wird normalerweise nicht ben&#246;tigt. Aber es gibt immer
      wieder Sportgerichtsentscheidungen, die Spielergebnisse auf den Kopf stellen. Unabh&#228;ngig vom eingegebenen Ergebnis kann hier
      eine Siegentscheidung eingestellt werden. Die Tore werden dann f&#252;r die Tabelle gez&#228;hlt, wie eingegeben, die Punkte aber
      richten sich dann nach dieser Einstellung. In der Regel sieht das dann so aus, da&#223; das Sportgericht sagt: 0:0 Tore und Team X
      gewinnt. Die Auswahl <strong>beidseitiges Erg.</strong> stellt nochmal einen Sonderfall dar, wenn das Sportgericht beispielsweise
      entscheidet, da&#223; das Spiel f&#252;r jede der beiden Mannschaften mit 2:0 Toren entschieden wird. In dem Fall w&#252;rde f&#252;r
      beide Teams auch jeweils ein 2:0 gewertet werden.</p>
      <p>Im n&#228;chsten Feld k&#246;nnen Sie eine <strong>Notiz</strong> zum Spiel eingeben. (Spielort z.B.) Auch eine normale
      Sportgerichtsentscheidung kann hier erw&#228;hnt werden, die Spezialf&#228;lle der Gr&#252;ne-Tisch-Entscheidungen brauchen hier
      nicht nochmal erw&#228;hnt zu werden, denn diese werden automatisch als Notiz eingef&#252;gt.</p>
      <p>Zuletzt haben Sie noch die M&#246;glichkeit, eine <strong>URL zum Spielbericht</strong> einzuf&#252;gen, falls sie das
      m&#246;chten. Diese URL wird aber nur dann dargestellt werden, wenn die <a href="#4">Einstellung</a> <strong>Spielberichte
      verlinken</strong> aktiviert ist.</p>
      <p>Falls Sie das <a href="../addons/tippspiel.html">Tippspiel</a> benutzen, k&#246;nnen hier einzelne Spiele von der Wertung
      ausgenommen werden.</p>
      <p>Unterhalb der Spiele haben Sie noch <strong>spieltags-unabh&#228;ngige Einstellungen</strong>, die Sie hier gleich mit bearbeiten
      k&#246;nnen.</p>
      <p class="advanced">Bei <strong>Aktueller Spieltag</strong> braucht nur dann was verstellt zu werden, wenn der Spieltag, den Sie hier
      bearbeiten, nicht als aktueller Spieltag markiert werden soll. Das kann z.B. der Fall sein, wenn Sie ein verlegtes Spiel bearbeiten
      oder ein &#228;lteres Ergebnis korrigieren m&#252;ssen. W&#228;hlen Sie dann hier den Spieltag aus, der als aktueller Spieltag gelten
      soll. Sonst lassen Sie dieses Feld bitte unver&#228;ndert.</p>
      <p>Jetzt haben Sie noch die M&#246;glichkeit, den <strong>Newsticker</strong> zu aktivieren und die entsprechenden Meldungen
      einzugeben. Bitte beachten Sie: immer eine Meldung pro Zeile und keine Leerzeilen lassen.</p>
      <p>Klicken Sie nun auf <strong>Spieltag und Ticker speichern</strong>, um Ihre &#196;nderungen abzuspeichern. Bitte beachten Sie,
      da&#223; Ihre &#196;nderungen sofort nach dem Speichern von den Besuchern Ihrer Homepage gesehen werden k&#246;nnen. Gehen Sie also
      unbedingt sorgf&#228;ltig vor!</p>
      <p class="advanced">Haben Sie die <a href="#5">Manuelle Tabellensortierung</a> aktiviert, beachten Sie bitte folgendes, bevor Sie
      einen Spieltag speichern: Falls bereits die Tabelle dieses oder eines der folgenden Spieltage manuell nachsortiert waren, ist diese
      Sortierung nun aufgehoben. Eventuell ver&#228;nderte Ergebnisse hatten ja ihre Auswirkung auf diese Tabellen.</p><a href="#top">[nach
      oben]</a>
      <h3><a name="4">4. Grundeinstellungen</a></h3>
      <p>Hier legen Sie die Einstellungen der Liga fest. Bei KO-Turnieren werden nat&#252;rlich nur Einstellungen angezeigt, die hier auch
      von Bedeutung sind.</p>
      <dl>
        <dt>Grundwerte</dt>
        <dd>Hier legen Sie unter anderem den <strong>Namen Ihrer Liga</strong> fest. Dieser Name erscheint in den Auflistungen Ihrer Ligen
        und als &#220;berschrift im Besucher-Bereich. Neben dem Titel selbst und ggf. regionale Angaben sollte hier auch die Saison
        erw&#228;hnt werden, z.B. <kbd>1. Kreisklasse Hinterwelt 2001/02</kbd>.</dd>
        <dd>Weiterhin legen Sie hier die Einstellungen f&#252;r die <strong>Bezeichnung der Begriffe Pkt. und Tore</strong> fest. Je nach
        Sportart k&#246;nnen Sie diese variieren.</dd>
        <dd>Falls Sie Sportarten verwalten, in denen mit <strong>Kommapunkten/-toren</strong> gerechnet wird, k&#246;nne Sie dies hier
        einstellen.</dd>
        <dd>F&#252;r die <strong>Hervorhebung der Lieblingsmannschaft</strong> sowie f&#252;r die <strong>Standardmannschaften f&#252;r
        Spielplan, Fieberkurven und Statistik</strong> w&#228;hlen Sie hier die entsprechenden Mannschaften aus.</dd>
        <dt>Verlinkungen</dt>
        <dd>Hier legen Sie fest, ob die <a href="#6">Mannschaftshomepages</a> (erscheinen in der Tabelle) und die <a href=
        "#3">Spielberichte</a> (erscheinen in den Ergebnissen und Spielpl&#228;nen) verlinkt werden sollen.</dd>
        <dt>Anzeigen/Darstellung</dt>
        <dd>Hier legen Sie fest, was sie Ihren Besuchern alles anbieten wollen. Mit <strong>Startanzeige</strong> legen Sie fest, was Ihre
        Besuchern beim Laden einer Liga zuerst zu sehen bekommen. Als N&#228;chstes legen Sie fest, ob <a href="#3">Spieltagsdatum und
        Ansto&#223;termine</a> angezeigt werden sollen. Wenn keines von beiden aktiviert ist, werden Ihre Besucher auch keinen Kalender zu
        sehen bekommen. Ansonsten k&#246;nnen Sie den <strong>Kalender</strong> aber auch separat deaktivieren. Wenn Sie die
        Ansto&#223;termine aktiviert haben, sollten Sie auch noch festlegen, in welchem <strong>Format die Ansto&#223;termine</strong>
        dargestellt werden sollen.</dd>
        <dd>Die Einstellungen <strong>Spiel um Platz 3</strong> und <strong>Playdown erm&#246;glichen</strong> stehen nur bei KO-Turnieren
        zur Verf&#252;gung; hier legen Sie fest, ob ein kleines Finale stattfindet und ob (wie bei Playdowns &#252;blich) auch der
        Verlierer eine Runde weiter kommen kann.</dd>
        <dd>Die <strong>Kreuztabelle</strong> und die <strong>Fieberkurve</strong> k&#246;nnen auch deaktiviert werden. Bei der Fieberkurve
        kann das aus technischer Sicht notwendig sein, wenn Ihr Provider die GDLib (eine Programmbibliothek, mit der PHP selbstst&#228;ndig
        Grafiken erstellen kann) nicht installiert hat. Die Kreuztabelle m&#246;chten Sie eventuell dann deaktivieren, wenn es in Ihrer
        Liga keine R&#252;ckspiele gibt (z.B. in den Gruppenspielen der Fu&#223;ball-WM).</dd>
        <dt>Spielsystem</dt>
        <dd>Das <strong>Spielsystem</strong> beinhaltet alle Einstellungen, die den Modus der Liga betreffen. <strong>Minus-Punkte</strong>
        kennen wir aus 2-Punkt-Ligen, bei 3-Punkt-Ligen existieren diese nicht mehr. <strong>Spielende offen</strong> mu&#223; nur
        aktiviert werden, wenn bei einem Remis eine Verl&#228;ngerung bzw. Over time und ggf. sogar ein 11-Meter- bzw.
        Penalty-Schie&#223;en folgt. Die <strong>Tabellenspalte 'Unentschieden'</strong> braucht nur dann verborgen werden, wenn es
        generell keinen Unentschieden in Ihrer Liga gibt. <strong>Direkter Vergleich</strong> bedeutet, da&#223; bei Punktgleichheit der
        direkte Vergleich der punktgleichen Mannschaften untereinander ber&#252;cksichtigt wird. <strong>Erzielte Tore z&#228;hlen vor
        Tordiff.</strong> mu&#223; nur aktiviert werden, wenn in Ihrer Liga die erzielten Tore in der Tabelle schwerer wiegen, als die
        Tordifferenz, was eher selten der Fall ist. Die <strong>Handsortierung der Tabelle erm&#246;glichen</strong> sollten Sie wirklich
        nur im Ausnahmefall; nur dann, wenn es beispielsweise Sonderegelungen gibt, die diese Software nicht ber&#252;cksichtigt. Sie haben
        dann die M&#246;glichkeit, die <a href="#5">Tabellensortierung per Hand zu korrigieren</a>.</dd>
        <dt>Tabelle</dt>
        <dd>
          Hier legen Sie fest, welche Einträge Ihrer Tabelle (und der Fieberkurve) hervorgehoben oder angezeigt werden sollen.
          <ul>
            <li>Hin-/Rückrundentabellen</li>
            <li>Heim-/Auswärtstabellen</li>
            <li>Meister</li>
            <li>Aufsteiger</li>
            <li>Absteiger</li>
            <li>sonstige Markierungen wie z.B. UEFA-Cup-Plätze</li>
          </ul>Ein Wert von 0 deaktiviert die entsprechende Markierung.
        </dd>
        <dt>Punktsystem</dt>
        <dd>Als Letztes legen Sie noch das <strong>Punktsystem</strong> fest, also wof&#252;r es wieviele Punkte gibt. Bei aktivierten
        Minuspunkten sollten Sie beachten, da&#223; Siegpunkte immer auch negative Niederlagenpunkte sind und umgekehrt; Bei Remis werden
        die entsprechenden Punkte zu den positiven und zu den negativen Punkten gez&#228;hlt.</dd>
        <dt>Spieltags- und Spiel-Anzahl</dt>
        <dd class="advanced">Normalerweise brauchen Sie diese Funktion nicht. Aber sollte es aus einem Grund n&#246;tig sein, die Anzahl
        der Spieltage oder die Anzahl der Spiele pro Spieltag zu ver&#228;ndern, k&#246;nnen Sie das hier tun. Legen Sie sich aber vorher
        besser <a href="dateifunktionen.html#3">eine Sicherheitskopie</a> Ihrer Liga an! Diese Funktion steht bei KO-Turnieren nicht zur
        Verf&#252;gung.</dd>
      </dl><a href="#top">[nach oben]</a>
      <h3><a name="5">5. Manuelle Tabellensortierung</a></h3>
      <p class="advanced">Haben Sie die <a href="#4">Einstellung</a> <strong>Handsortierung der Tabelle erm&#246;glichen</strong>
      aktiviert, steht Ihnen am unteren Rand des <a href="#3">Ergebniseditors</a>/Einstellungsbildschirms die Auswahl
      <strong>Tabelle</strong> zur Verf&#252;gung. Klicken Sie darauf, um die Tabelle zu pr&#252;fen und gegebenenfalls eine manuelle
      Korrektur vorzunehmen.</p>
      <p>Sie k&#246;nnen auch hier unterhalb des Men&#252;s den Spieltag ausw&#228;hlen, dessen Tabelle Sie pr&#252;fen und ggf.
      korrigieren wollen. Sie bekommen die Tabelle so angezeigt und sortiert, wie es die Software ermittelt hat. Wenn Sie diese Tabelle
      f&#252;r korrekt halten, brauchen Sie nichts weiter zu tun.</p>
      <p>Ansonsten m&#252;ssen Sie Korrekturen vornehmen, indem Sie den Mannschaften neue Platzierungen zuweisen. Dabei darf nat&#252;rlich
      keine Platzierung doppelt vergeben werden (normalerweise verhindert eine JavaScript-Funktion das).</p>
      <p>Haben Sie den Mannschaften nun den richtigen Tabellenplatz zugewiesen, klicken Sie auf <strong>manuelle Tabelle
      speichern</strong>. Bei einen Blick in den Besucherbereich des LMO werden Sie sehen, da&#223; die entsprechende Tabelle (und die
      Fieberkurve) Ihren &#196;nderungen gem&#228;&#223; dargestellt wird.</p><a href="#top">[nach oben]</a>
      <h3><a name="6">6. Der Mannschaftseditor</a></h3>
      <p>Hier k&#246;nnen Sie die <strong>Mannschaftsnamen</strong> eingeben und &#228;ndern, das <strong>K&#252;rzel</strong> darf aus
      max. 5 Zeichen bestehen.</p>
      <p>Falls der Verband Straf- bzw. Bonuspunkte und Tore vergeben sollte, kann man diese hier eintragen. Sie werden bei der Berechnung
      der Tabelle ber&#252;cksichtigt. Man kann auch festlegen, dass die &#196;nderung erst ab einem bestimmten Spieltag wirksam werden
      soll.</p>
      <p>Falls Sie die Homepage der Mannschaften linken wollen, k&#246;nnen Sie die entsprechenden URL in der n&#228;chsten Spalte
      eintragen. Diese Links werden in der Tabelle angezeigt; aber nur, wenn die <a href="#4">Einstellung</a> <strong>Mannschafts-Homepages
      verlinken</strong> aktiviert ist.</p>
      <p class="attention">Es gibt zudem f&#252;r jede Mannschaft eine Funktion, mit der eine <strong>Mannschaft aus der Liga
      zur&#252;ckgezogen</strong> werden kann. Weiterhin kann man auch eine <strong>neue Mannschaft nachtr&#228;glich zur Liga
      hinzuf&#252;gen</strong>. <em>Legen Sie sich vor der Nutzung dieser Funktionen besser <a href="dateifunktionen.html#3">eine
      Sicherheitskopie</a> Ihrer Liga an!</em> Falls Sie das Tippspiel für diese Liga benutzen, führen diese Funktionen zu Fehlfunktionen
      im Tippspiel! Bei KO-Turnieren stehen diese Funktionen nicht zur Verf&#252;gung.</p><a href="#top">[nach oben]</a>
    </div>
    <dl id="footer">
      <dt>&copy;&nbsp;2004-2009&nbsp;-&nbsp;<a href="http://liga-manager-online.de">Liga Manager Online</a></dt>
    </dl>
  </div>
</body>
</html>
