<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<title>Hilfe Optionen</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" href="../media/lmo.css" type="text/css">

<div id="container">
    <div id="header">
      <a href="http://www.liga-manager-online.de/"><img src=
      "../media/logo_lmo.gif" alt="Liga Manager Online" width="492" height="48"
      border="0"></a>
    </div>

    <div id="back">
       
    </div>

    <div id="urhere">
       
    </div>

    <div id="navi">
      <ul>
        <li id="flags"> 
      </ul>

      <div class="navigation">
        <ul>
          <li>
            <a class="active" href="index.html">Hilfe</a>

            <ul>
              <li><a class="page" href=
              "einstiegsinformationen.html">Einstiegsinformationen</a>

              <li><a class="active" href="optionen.html">Optionen</a>

              <li><a class="page" href="bearbeiten_einer_liga.html">Bearbeiten
              einer Liga</a>

              <li><a class="page" href=
              "dateifunktionen.html">Dateifunktionen</a>

              <li><a class="page" href="anpassung_des_lmo.html">Anpassung des
              LMO</a>
            </ul>

          <li><a class="folder" href="addons/index.html">Addons</a>
        </ul>
      </div>
    </div>

    <div id="content">
      <a name="top" id="top"></a>

      <h1>Optionen</h1>

      <ol type="1">
        <li><a href="#1">Globale Optionen</a>

        <li><a href="#2">Die Addonverwaltung</a>

        <li><a href="#3">Der Designeditor</a>

        <li><a href="#4">Die Userverwaltung</a>

        <li><a href="#5">Das Ligenarchiv</a>
      </ol>

      <h3><a name="1">1. Globale Optionen</a></h3>

      <p>Mit einem Klick auf den Men&amp;#252;befehl <strong>Optionen</strong>
      gelangen Sie in den Optionsbereich. Hier werden die globalen
      Skriptoptionen festgelegt. <a href="#optionen0401">Hilfs-Admins</a> haben
      hier keinen Zutritt.

      <dl>
        <dt>Grundeinstellungen

        <dd>In den Grundeinstellungen legen Sie die
        <strong>Standardsprache</strong> , das verwendete
        <strong>Ligenverzeichnis</strong>, die
        <strong>Standard-Ansto&amp;#223;zeit</strong>, das <strong>Format der
        Ansto&amp;#223;termine</strong> , die <strong>E-Mail des
        Webmasters</strong> sowie die Reihenfolge der
        <strong>Ligasortierung</strong> im Ligenauswahlbereich fest.

        <dt>Tabellenoptionen

        <dd>Hier legen Sie fest, wo die <strong>Punkte-Spalte</strong> in der
        Tabelle dargestellt wird und welche Art von
        <strong>Tabellendarstellung</strong> Sie w&amp;#252;nschen.

        <dt>Anzeigen/Darstellung

        <dd>Hier steuern Sie die Darstellung der verschiedenen Komponenten des
        LMO. Sie legen fest, ob der jeweilige Teil angezeigt werden soll.
      </dl><a href="#top">[nach oben]</a>

      <h3><a name="2">2. Die Addonverwaltung</a></h3>

      <p>Dieser Teil der Optionen dient zum Steuern der Addons, welche den LMO
      um zus&amp;#228;tzliche Funktionen erweitern.

      <p class="attention">Die Addonverwaltung ist vor allem f&amp;#252;r
      versierte Benutzer gedacht, die genau wissen, was sie tun. Bitte
      &amp;#228;ndern Sie hier nur Optionen, falls das betreffende Addon keine
      eigene Konfigurationsoberfl&amp;#228;che besitzt.

      <p class="advanced">Sie k&amp;#246;nnen im Auswahlmen&amp;#252; das
      entsprechende Addon ausw&amp;#228;hlen und dort die
      Konfigurationsvariablen direkt &amp;#228;ndern. Beachten Sie, dass
      keinerlei Pr&amp;#252;fung der Eingaben statt findet - falsche oder
      unsinnige Angaben k&amp;#246;nnen den LMO im schlimmsten Fall unbrauchbar
      machen!<a href="#top">[nach oben]</a>

      <h3><a name="3">3. Der Designeditor</a></h3>

      <p>Der Designeditor liefert Ihnen die wichtigsten
      Einstellungsm&amp;#246;glichkeiten f&amp;#252;r die Farben und Schriften,
      die das Skript zur Darstellung verwendet. Spielen Sie ein wenig mit den
      Einstellungen herum, um die bestm&amp;#246;gliche Anpassung des Designs
      an ihre Homepage zu erhalten.

      <p class="advanced">Sie haben auch die M&amp;#246;glichkeit, eigene
      Erg&amp;#228;nzungen vorzunehmen, dazu editieren Sie die Datei
      <strong>templates/style.css</strong>. Die dort gemachten CSS-Styles
      werden automatisch vom LMO &amp;#252;bernommen.<a href="#top">[nach
      oben]</a>

      <h3><a name="4">4. Die Userverwaltung</a></h3>

      <p>Die Userverwaltung wird ja vergleichsweise selten gebraucht und ist
      daher nicht direkt erreichbar. W&amp;#228;hlen Sie den Men&amp;#252;punkt
      <strong>Optionen</strong> und anschlie&amp;#223;end im
      Untermen&amp;#252;&amp;#160; <strong>Userverwaltung</strong>.

      <p>Zuerst haben Sie alle eingerichteten Admins und <a href=
      "#optionen0401">Hilfs-Admins</a> aufgelistet. Wollen Sie
      &amp;#196;nderungen vornehmen, w&amp;#228;hlen Sie den betreffenden
      (Hilfs-)Admin aus, &amp;#228;ndern Sie die gew&amp;#252;nschten Angaben
      und klicken Sie danach auf den entsprechenden <strong>Speichern</strong>
      -Button. Wollen Sie einen Account l&amp;#246;schen, klicken Sie einfach
      auf den entsprechenden <strong>L&amp;#246;schen</strong>-Button. Achtung,
      das ist nicht mehr r&amp;#252;ckg&amp;#228;ngig zu machen!

      <p>Bei den Hilfs-Admins gibt es zus&amp;#228;tzlich die Auswahl der
      <strong>Freigegebenen Ligen</strong>. Hier legen Sie fest, auf welche
      Ligen der jeweilige Hilfsadmin Zugriff haben soll.

      <p>Wollen Sie einen neuen Admin oder Hilfs-Admin hinzuf&amp;#252;gen?
      Dann ist der Bereich <strong>Neuen Admin hinzuf&amp;#252;gen</strong>
      wichtig. Hier stehen schon Vorgaben in den Feldern, die Sie
      nat&amp;#252;rlich auch &amp;#228;ndern k&amp;#246;nnen, bevor Sie den
      neuen Admin-Account anlegen. Das Passwort ist ein Zufallspasswort, das
      Sie ruhigen Gewissens &amp;#252;bernehmen k&amp;#246;nnen. Wenn alles
      korrekt eingegeben wurde, klicken Sie auf den <strong>Speichern</strong>
      -Button. Danach sollten Sie dem neuen Administrator seine Rechte
      zuweisen.

      <h4><a name="optionen0401" id=
      "optionen0401">&amp;#160;</a>Hilfs-Admins</h4>

      <p>Sie betreuen auf Ihrer Homepage mehrere Ligen und haben auch Helfer,
      die immer die aktuellen Ergebnisse f&amp;#252;r Sie zusammentragen? Dann
      wird es Sie freuen, zu erfahren, da&amp;#223; Sie auch spezielle Accounts
      f&amp;#252;r Ihre Helfer einrichten k&amp;#246;nnen. Diese 'Hilfs-Admins'
      k&amp;#246;nnen dann ihre Ergebnisse eintragen, haben aber keinen Zugang
      zu den empfindlicheren Einstellungen Ihrer Liga oder zu den Optionen des
      Skripts.

      <h4><a name="optionen0402" id="optionen0402">&amp;#160;</a>Erweiterte
      Hilfs-Admins</h4>

      <p>Falls die Rechte eines normalen Hilfs-Admin nicht ausreichend sind,
      haben Sie die M&amp;#246;glichkeit diese Rechte zu erweitern. Ein
      Erweiterter Hilfsadmin ist quasi ein vollwertiger Administrator,
      allerdings nur f&amp;#252;r seine Ligen.

      <ul>
        <li>Er kann nur ihm zugewiesene Ligen komplett administrieren

        <li>Er hat keinen Zugriff auf globale Optionen des LMO
      </ul><a href="#top">[nach oben]</a>

      <h3><a name="5">5. Das Ligenarchiv</a></h3>

      <p>Falls Sie abgelaufene Ligen weiterhin anbieten m&amp;#246;chten, ohne
      dass die Ligenauswahl zu lang wird, k&amp;#246;nnen Sie diese Ligen auch
      im integrierten Archiv ablegen. Legen Sie dazu im Ordner
      <strong>ligen/</strong> ein neues Verzeichnis mit
      aussagekr&amp;#228;ftiger Bezeichnung an. (Bsp: Bundesliga) In dieses
      Verzeichnis verschieben Sie die gew&amp;#252;nschten Ligen.

      <p>Falls Sie die entsprechende Einstellung in den <a href=
      "optionen.html#1">globalen Optionen</a> get&amp;#228;tigt haben, wird nun
      f&amp;#252;r ihre Benutzer das Archiv sichtbar. Im Archiv selbst ist
      f&amp;#252;r jedes angelegte Unterverzeichnis ein Link angezeigt. (Sie
      k&amp;#246;nnen sogar die Verzeichnisse weiter verschachteln, um ihr
      Archiv noch weiter zu gliedern)

      <p class="advanced">Um einen ausf&amp;#252;hrlicheren
      Erkl&amp;#228;rungstext anzugeben, welcher zu jedem Verzeichnis angezeigt
      wird, erstellen Sie eine Textdatei <strong>dir-descr.txt</strong> ,
      schreiben dort ihre Erl&amp;#228;uterung ein (Bsp: Alle Bundesligen von
      1963 bis 2000) und speichern Sie diese in das entsprechende Verzeichnis.
      Nach dem Klick auf den Verzeichnislink k&amp;#246;nnen Ihre Besucher nun
      die darin befindlichen Ligen ganz normal ausw&amp;#228;hlen.

      <p><a href="#top">[nach oben]</a>
    </div>

    <dl id="footer">
      <dt>© Liga Manager Online 2004/05
    </dl>
  </div>

