<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<title>Hilfe Bearbeiten einer Liga</title>
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" href="../media/lmo.css" type="text/css">
<script type="text/javascript">
</script>

<div id="container">
    <div id="header">
      <a href="http://www.liga-manager-online.de/"><img src=
      "../media/logo_lmo.gif" alt="Liga Manager Online" width="492" height="48"
      border="0"></a>
    </div>

    <div id="back">
       
    </div>

    <div id="urhere">
       
    </div>

    <div id="navi">
      <ul>
        <li id="flags"> 
      </ul>

      <div class="navigation">
        <ul>
          <li>
            <a class="active" href="index.html">Hilfe</a>

            <ul>
              <li><a class="page" href=
              "einstiegsinformationen.html">Einstiegsinformationen</a>

              <li><a class="page" href="optionen.html">Optionen</a>

              <li><a class="active" href=
              "bearbeiten_einer_liga.html">Bearbeiten einer Liga</a>

              <li><a class="page" href=
              "dateifunktionen.html">Dateifunktionen</a>

              <li><a class="page" href="anpassung_des_lmo.html">Anpassung des
              LMO</a>
            </ul>

          <li><a class="folder" href="addons/index.html">Addons</a>
        </ul>
      </div>
    </div>

    <div id="content">
      <a name="top" id="top"></a>

      <h1>Bearbeiten einer Liga</h1>

      <ol type="1">
        <li><a href="#1">Erstellen einer Liga</a>

        <li><a href="#2">Öffnen einer Liga</a>

        <li><a href="#3">Der Ergebniseditor</a>

        <li><a href="#4">Grundeinstellungen</a>

        <li><a href="#5">Manuelle Tabellensortierungs</a>

        <li><a href="#6">Der Mannschaftseditor</a>
      </ol>

      <h3><a name="1">1. Erstellen einer Liga</a></h3>

      <p>Klicken Sie im Men&amp;#252; auf <strong>Neu</strong>, um eine neue
      Liga zu erstellen. Der Erstellungsproze&amp;#223; umfa&amp;#223;t 4
      Schritte:

      <p>Zuerst legen Sie den <strong>Dateinamen</strong> der Liga fest.
      Verzichten Sie dabei auf den Pfad und die Namenserweiterung, diese sind
      bereits vorgegeben. Achten Sie darauf, da&amp;#223; Ihre Eingabe max. 28
      Zeichen lang sein darf. Geben Sie der Liga nun einen
      aussagekr&amp;#228;ftigen <strong>Namen</strong>. Dieser Titel erscheint
      in den Auflistungen Ihrer Ligen und als &amp;#220;berschrift im
      Besucher-Bereich. Neben dem Titel selbst und ggf. regionale Angaben
      sollte hier auch die Saison erw&amp;#228;hnt werden, z.B. <kbd>1.
      Kreisklasse Hinterwelt 2001/02</kbd>. Legen Sie nun noch fest, ob Sie
      eine <strong>Liga</strong> (mit Punkten, Tabelle usw.) oder ein
      <strong>KO-Turnier</strong> (PlayOff, Turnier o.&amp;#228;.) anlegen.
      Klicken Sie auf <strong>Weiter</strong> , um fortzufahren.

      <p>Als N&amp;#228;chstes legen Sie die <strong>Anzahl der
      Mannschaften</strong> fest. Erstellen Sie eine Liga, legen Sie bitte auch
      die <strong>Anzahl der Spieltage</strong> und die <strong>Anzahl der
      Spiele pro Spieltag</strong> fest. Bei KO-Turnieren ist das nicht
      notwendig, da diese Einstellungen hier schon durch die Anzahl der
      Mannschaften bestimmt wird. Klicken Sie auf <strong>Weiter</strong>, um
      fortzufahren.

      <p>Der 3. Schritt ist bei Ligen die <strong>Spielplanerstellung</strong>.
      <strong>Spielpl&amp;#228;ne aus anderen Ligen
      &amp;#252;bernehmen</strong> funktioniert nur bei Ligen, die die gleichen
      Anzahlen an Mannschaften, Spielen und Spieltagen hat. Der
      <strong>zuf&amp;#228;llige Spielplan</strong> entspricht dem aus dem
      LM98Free bekannten System; er kann nur dann erstellt werden, wenn es sich
      um eine 'normale' Liga handelt, in der jedes Team 1 Hin- und 1
      R&amp;#252;ckspiel gegen jeden Gegner hat (wie in der
      Fu&amp;#223;ball-Bundesliga). Sie k&amp;#246;nnen aber auch ganz auf die
      Spielplanerstellung verzichten.

      <p>Bei KO-Turnieren legen Sie im 3. Schritt der Erstellung fest, welchen
      <strong>Spielmodus</strong> die einzelnen Runden Ihres Turniers haben
      sollen. Klicken Sie auf <strong>Weiter</strong>, um zum letzten Schritt
      zu gelangen.

      <p>Die <strong>Liga wurde gespeichert</strong> und Sie sollten als
      N&amp;#228;chstes die <a href="#6">Mannschaften</a> bearbeiten. Erstmal
      sind die Mannschaften nur durchnummeriert und Sie k&amp;#246;nnen nun die
      Namen und alles weitere frei festlegen. Bei neuen Ligen, deren
      Spielpl&amp;#228;ne Sie aus anderen Ligen &amp;#252;bernommen haben,
      sollten Sie vorher einen Blick in den Besucherbereich werfen und anhand
      der Spielpl&amp;#228;ne der einzelnen Mannschaften herausfinden, welche
      Mannschaft welchem Eintrag zugeordnet werden mu&amp;#223;.<a href=
      "#top">[nach oben]</a>

      <h3><a name="2">2. &amp;#214;ffnen einer Liga</a></h3>

      <p>Wenn Sie sich in den Adminbereich <a href=
      "einstiegsinformationen.html#4">eingeloggt</a> haben, erhalten Sie einen
      &amp;#220;bersicht, in der auch alle verf&amp;#252;gbaren Ligen
      aufgelistet sind. Sonst klicken Sie einfach im Men&amp;#252; auf
      <strong>&amp;#214;ffnen</strong>, um eine Auflistung der Ligen zu
      erhalten. W&amp;#228;hlen Sie hier die Liga aus, die Sie bearbeiten
      m&amp;#246;chten und klicken Sie sie an. <a href=
      "optionen.html#optionen0401">Hilfs-Admins</a> k&amp;#246;nnen nur die
      Ligen ausw&amp;#228;hlen, die f&amp;#252;r sie freigegeben wurden.

      <p><a href="#top">[nach oben]</a>

      <h3><a name="3">3. Der Ergebniseditor</a></h3>

      <p>Nach dem <a href="#2">&amp;#214;ffnen der Liga</a> gelangen Sie gleich
      automatisch in den Ergebniseditor und der aktuelle Spieltag wird
      dargestellt. In der Auswahl unterhalb des Men&amp;#252;s k&amp;#246;nnen
      Sie auch einen anderen Spieltag zum Bearbeiten ausw&amp;#228;hlen.

      <p>Ganz oben k&amp;#246;nnen Sie das <strong>Start- und Enddatum</strong>
      des Spieltags festlegen. Achten Sie unbedingt darauf, das das Datum in
      der Form TT.MM.JJJJ (2stelliger Tag, 2stelliger Monat und 4stelliges Jahr
      durch Punkte getrennt) eingegeben werden mu&amp;#223;. Neben den
      Datumsfeldern ist jeweils ein Button angebracht, der einen PopUp-Kalender
      &amp;#246;ffnet, wo Sie durch Anklicken einfach ein Datum
      ausw&amp;#228;hlen k&amp;#246;nnen. Diese Datumswerte werden den
      Besuchern nur dann angezeigt, wenn die <a href="#4">Einstellung</a>
      <strong>Spieltagsdatum</strong> aktiviert.

      <p>Jedem Spiel kann auch ein <strong>Ansto&amp;#223;termin</strong>
      zugeordnet werden. Beachten Sie auch hier die Form TT.MM.JJJJ
      f&amp;#252;r das Datum. Und auch hier gibt es einen Button f&amp;#252;r
      den PopUp-Kalender. Wenn Sie ein Datum und keine Zeit eingeben, wird
      automatisch die <a href=
      "optionen.html#1">Standard-Ansto&amp;#223;zeit</a>&amp;#160;&amp;#252;bernommen.
      Geben Sie eine Zeit ein, achten Sie bitte auf die Form HH:MM (2stellige
      Stund und 2stellige Minute durch : getrennt).

      <p>Die <strong>Mannschaften</strong> w&amp;#228;hlen Sie einfach durch
      Klicks auf die Comboboxen aus.

      <p>Bei der <strong>Ergebniseingabe</strong> haben Sie mehrere
      M&amp;#246;glichkeiten. Am einfachsten ist es, Sie klicken ganz einfach
      auf die kleinen Pfeilbuttons neben den Ergebnisfeldern. Wenn Sie sich mit
      dem Textcursor in einem Ergebnisfeld befinden, k&amp;#246;nnen sie auch
      mit den Pfeiltasten hoch und runter das Ergebnis &amp;#228;ndern oder Sie
      tippen die Zahl ganz normal ein. Falls Sie die Option f&amp;#252;r
      Nachkommastellen in den <a href="#4">Grundeinstellungen</a> aktiviert
      haben, geben Sie die Ergebnisse weiterhin als ganze Zahlen ein, die
      Umrechnung wird erst zur Ausgabe sichtbar.

      <p>Falls Ihre Liga ein <a href="#4">offenes Spielende</a> hat oder ein
      KO-Turnier ist, geben Sie als N&amp;#228;chstes an, wann das Spiel
      endete: Normal (_), nach Verl&amp;#228;ngerung/Over time (n.V.) oder Im
      11-Meter-/Penalty-Schie&amp;#223;en (i.E.).

      <p class="attention">Meistens werden in einer Sportgerichtsentscheidung
      sowohl Punkte als auch Tore ge&amp;#228;ndert. (Also einer Mannschaft der
      Sieg aberkannt z.B.) In diesem Fall brauchen Sie die folgende Option
      nicht zu benutzen!

      <p class="advanced">Das Feld
      <strong>Gr&amp;#252;ne-Tisch-Entsch.</strong> wird normalerweise nicht
      ben&amp;#246;tigt. Aber es gibt immer wieder Sportgerichtsentscheidungen,
      die Spielergebnisse auf den Kopf stellen. Unabh&amp;#228;ngig vom
      eingegebenen Ergebnis kann hier eine Siegentscheidung eingestellt werden.
      Die Tore werden dann f&amp;#252;r die Tabelle gez&amp;#228;hlt, wie
      eingegeben, die Punkte aber richten sich dann nach dieser Einstellung. In
      der Regel sieht das dann so aus, da&amp;#223; das Sportgericht sagt: 0:0
      Tore und Team X gewinnt. Die Auswahl <strong>beidseitiges Erg.</strong>
      stellt nochmal einen Sonderfall dar, wenn das Sportgericht beispielsweise
      entscheidet, da&amp;#223; das Spiel f&amp;#252;r jede der beiden
      Mannschaften mit 2:0 Toren entschieden wird. In dem Fall w&amp;#252;rde
      f&amp;#252;r beide Teams auch jeweils ein 2:0 gewertet werden.

      <p>Im n&amp;#228;chsten Feld k&amp;#246;nnen Sie eine
      <strong>Notiz</strong> zum Spiel eingeben. (Spielort z.B.) Auch eine
      normale Sportgerichtsentscheidung kann hier erw&amp;#228;hnt werden, die
      Spezialf&amp;#228;lle der Gr&amp;#252;ne-Tisch-Entscheidungen brauchen
      hier nicht nochmal erw&amp;#228;hnt zu werden, denn diese werden
      automatisch als Notiz eingef&amp;#252;gt.

      <p>Zuletzt haben Sie noch die M&amp;#246;glichkeit, eine <strong>URL zum
      Spielbericht</strong> einzuf&amp;#252;gen, falls sie das
      m&amp;#246;chten. Diese URL wird aber nur dann dargestellt werden, wenn
      die <a href="#4">Einstellung</a> <strong>Spielberichte verlinken</strong>
      aktiviert ist.

      <p>Falls Sie das <a href="../addons/tippspiel.html">Tippspiel</a>
      benutzen, k&amp;#246;nnen hier einzelne Spiele von der Wertung
      ausgenommen werden.

      <p>Unterhalb der Spiele haben Sie noch
      <strong>spieltags-unabh&amp;#228;ngige Einstellungen</strong>, die Sie
      hier gleich mit bearbeiten k&amp;#246;nnen.

      <p class="advanced">Bei <strong>Aktueller Spieltag</strong> braucht nur
      dann was verstellt zu werden, wenn der Spieltag, den Sie hier bearbeiten,
      nicht als aktueller Spieltag markiert werden soll. Das kann z.B. der Fall
      sein, wenn Sie ein verlegtes Spiel bearbeiten oder ein &amp;#228;lteres
      Ergebnis korrigieren m&amp;#252;ssen. W&amp;#228;hlen Sie dann hier den
      Spieltag aus, der als aktueller Spieltag gelten soll. Sonst lassen Sie
      dieses Feld bitte unver&amp;#228;ndert.

      <p>Jetzt haben Sie noch die M&amp;#246;glichkeit, den
      <strong>Newsticker</strong> zu aktivieren und die entsprechenden
      Meldungen einzugeben. Bitte beachten Sie: immer eine Meldung pro Zeile
      und keine Leerzeilen lassen.

      <p>Klicken Sie nun auf <strong>Spieltag und Ticker speichern</strong>, um
      Ihre &amp;#196;nderungen abzuspeichern. Bitte beachten Sie, da&amp;#223;
      Ihre &amp;#196;nderungen sofort nach dem Speichern von den Besuchern
      Ihrer Homepage gesehen werden k&amp;#246;nnen. Gehen Sie also unbedingt
      sorgf&amp;#228;ltig vor!

      <p class="advanced">Haben Sie die <a href="#5">Manuelle
      Tabellensortierung</a> aktiviert, beachten Sie bitte folgendes, bevor Sie
      einen Spieltag speichern: Falls bereits die Tabelle dieses oder eines der
      folgenden Spieltage manuell nachsortiert waren, ist diese Sortierung nun
      aufgehoben. Eventuell ver&amp;#228;nderte Ergebnisse hatten ja ihre
      Auswirkung auf diese Tabellen.<a href="#top">[nach oben]</a>

      <h3><a name="4">4. Grundeinstellungen</a></h3>

      <p>Hier legen Sie die Einstellungen der Liga fest. Bei KO-Turnieren
      werden nat&amp;#252;rlich nur Einstellungen angezeigt, die hier auch von
      Bedeutung sind.

      <dl>
        <dt>Grundwerte

        <dd>Hier legen Sie unter anderem den <strong>Namen Ihrer Liga</strong>
        fest. Dieser Name erscheint in den Auflistungen Ihrer Ligen und als
        &amp;#220;berschrift im Besucher-Bereich. Neben dem Titel selbst und
        ggf. regionale Angaben sollte hier auch die Saison erw&amp;#228;hnt
        werden, z.B. <kbd>1. Kreisklasse Hinterwelt 2001/02</kbd>.

        <dd>Weiterhin legen Sie hier die Einstellungen f&amp;#252;r die
        <strong>Bezeichnung der Begriffe Pkt. und Tore</strong> fest. Je nach
        Sportart k&amp;#246;nnen Sie diese variieren.

        <dd>Falls Sie Sportarten verwalten, in denen mit
        <strong>Kommapunkten/-toren</strong> gerechnet wird, k&amp;#246;nne Sie
        dies hier einstellen.

        <dd>F&amp;#252;r die <strong>Hervorhebung der
        Lieblingsmannschaft</strong> sowie f&amp;#252;r die
        <strong>Standardmannschaften f&amp;#252;r Spielplan, Fieberkurven und
        Statistik</strong> w&amp;#228;hlen Sie hier die entsprechenden
        Mannschaften aus.

        <dt>Verlinkungen

        <dd>Hier legen Sie fest, ob die <a href="#6">Mannschaftshomepages</a>
        (erscheinen in der Tabelle) und die <a href="#3">Spielberichte</a>
        (erscheinen in den Ergebnissen und Spielpl&amp;#228;nen) verlinkt
        werden sollen.

        <dt>Anzeigen/Darstellung

        <dd>Hier legen Sie fest, was sie Ihren Besuchern alles anbieten wollen.
        Mit <strong>Startanzeige</strong> legen Sie fest, was Ihre Besuchern
        beim Laden einer Liga zuerst zu sehen bekommen. Als N&amp;#228;chstes
        legen Sie fest, ob <a href="#3">Spieltagsdatum und
        Ansto&amp;#223;termine</a> angezeigt werden sollen. Wenn keines von
        beiden aktiviert ist, werden Ihre Besucher auch keinen Kalender zu
        sehen bekommen. Ansonsten k&amp;#246;nnen Sie den
        <strong>Kalender</strong> aber auch separat deaktivieren. Wenn Sie die
        Ansto&amp;#223;termine aktiviert haben, sollten Sie auch noch
        festlegen, in welchem <strong>Format die
        Ansto&amp;#223;termine</strong> dargestellt werden sollen.

        <dd>Die Einstellungen <strong>Spiel um Platz 3</strong> und
        <strong>Playdown erm&amp;#246;glichen</strong> stehen nur bei
        KO-Turnieren zur Verf&amp;#252;gung; hier legen Sie fest, ob ein
        kleines Finale stattfindet und ob (wie bei Playdowns &amp;#252;blich)
        auch der Verlierer eine Runde weiter kommen kann.

        <dd>Die <strong>Kreuztabelle</strong> und die
        <strong>Fieberkurve</strong> k&amp;#246;nnen auch deaktiviert werden.
        Bei der Fieberkurve kann das aus technischer Sicht notwendig sein, wenn
        Ihr Provider die GDLib (eine Programmbibliothek, mit der PHP
        selbstst&amp;#228;ndig Grafiken erstellen kann) nicht installiert hat.
        Die Kreuztabelle m&amp;#246;chten Sie eventuell dann deaktivieren, wenn
        es in Ihrer Liga keine R&amp;#252;ckspiele gibt (z.B. in den
        Gruppenspielen der Fu&amp;#223;ball-WM).

        <dt>Spielsystem

        <dd>Das <strong>Spielsystem</strong> beinhaltet alle Einstellungen, die
        den Modus der Liga betreffen. <strong>Minus-Punkte</strong> kennen wir
        aus 2-Punkt-Ligen, bei 3-Punkt-Ligen existieren diese nicht mehr.
        <strong>Spielende offen</strong> mu&amp;#223; nur aktiviert werden,
        wenn bei einem Remis eine Verl&amp;#228;ngerung bzw. Over time und ggf.
        sogar ein 11-Meter- bzw. Penalty-Schie&amp;#223;en folgt. Die
        <strong>Tabellenspalte 'Unentschieden'</strong> braucht nur dann
        verborgen werden, wenn es generell keinen Unentschieden in Ihrer Liga
        gibt. <strong>Direkter Vergleich</strong> bedeutet, da&amp;#223; bei
        Punktgleichheit der direkte Vergleich der punktgleichen Mannschaften
        untereinander ber&amp;#252;cksichtigt wird. <strong>Erzielte Tore
        z&amp;#228;hlen vor Tordiff.</strong> mu&amp;#223; nur aktiviert
        werden, wenn in Ihrer Liga die erzielten Tore in der Tabelle schwerer
        wiegen, als die Tordifferenz, was eher selten der Fall ist. Die
        <strong>Handsortierung der Tabelle erm&amp;#246;glichen</strong>
        sollten Sie wirklich nur im Ausnahmefall; nur dann, wenn es
        beispielsweise Sonderegelungen gibt, die diese Software nicht
        ber&amp;#252;cksichtigt. Sie haben dann die M&amp;#246;glichkeit, die
        <a href="#5">Tabellensortierung per Hand zu korrigieren</a>.

        <dt>Tabelle

        <dd>
          Hier legen Sie fest, welche Einträge Ihrer Tabelle (und der
          Fieberkurve) hervorgehoben oder angezeigt werden sollen.

          <ul>
            <li>Hin-/Rückrundentabellen

            <li>Heim-/Auswärtstabellen

            <li>Meister

            <li>Aufsteiger

            <li>Absteiger

            <li>sonstige Markierungen wie z.B. UEFA-Cup-Plätze
          </ul>Ein Wert von 0 deaktiviert die entsprechende Markierung.

        <dt>Punktsystem

        <dd>Als Letztes legen Sie noch das <strong>Punktsystem</strong> fest,
        also wof&amp;#252;r es wieviele Punkte gibt. Bei aktivierten
        Minuspunkten sollten Sie beachten, da&amp;#223; Siegpunkte immer auch
        negative Niederlagenpunkte sind und umgekehrt; Bei Remis werden die
        entsprechenden Punkte zu den positiven und zu den negativen Punkten
        gez&amp;#228;hlt.

        <dt>Spieltags- und Spiel-Anzahl

        <dd class="advanced">Normalerweise brauchen Sie diese Funktion nicht.
        Aber sollte es aus einem Grund n&amp;#246;tig sein, die Anzahl der
        Spieltage oder die Anzahl der Spiele pro Spieltag zu
        ver&amp;#228;ndern, k&amp;#246;nnen Sie das hier tun. Legen Sie sich
        aber vorher besser <a href="dateifunktionen.html#3">eine
        Sicherheitskopie</a> Ihrer Liga an! Diese Funktion steht bei
        KO-Turnieren nicht zur Verf&amp;#252;gung.
      </dl><a href="#top">[nach oben]</a>

      <h3><a name="5">5. Manuelle Tabellensortierung</a></h3>

      <p class="advanced">Haben Sie die <a href="#4">Einstellung</a>
      <strong>Handsortierung der Tabelle erm&amp;#246;glichen</strong>
      aktiviert, steht Ihnen am unteren Rand des <a href=
      "#3">Ergebniseditors</a>/Einstellungsbildschirms die Auswahl
      <strong>Tabelle</strong> zur Verf&amp;#252;gung. Klicken Sie darauf, um
      die Tabelle zu pr&amp;#252;fen und gegebenenfalls eine manuelle Korrektur
      vorzunehmen.

      <p>Sie k&amp;#246;nnen auch hier unterhalb des Men&amp;#252;s den
      Spieltag ausw&amp;#228;hlen, dessen Tabelle Sie pr&amp;#252;fen und ggf.
      korrigieren wollen. Sie bekommen die Tabelle so angezeigt und sortiert,
      wie es die Software ermittelt hat. Wenn Sie diese Tabelle f&amp;#252;r
      korrekt halten, brauchen Sie nichts weiter zu tun.

      <p>Ansonsten m&amp;#252;ssen Sie Korrekturen vornehmen, indem Sie den
      Mannschaften neue Platzierungen zuweisen. Dabei darf nat&amp;#252;rlich
      keine Platzierung doppelt vergeben werden (normalerweise verhindert eine
      JavaScript-Funktion das).

      <p>Haben Sie den Mannschaften nun den richtigen Tabellenplatz zugewiesen,
      klicken Sie auf <strong>manuelle Tabelle speichern</strong>. Bei einen
      Blick in den Besucherbereich des LMO werden Sie sehen, da&amp;#223; die
      entsprechende Tabelle (und die Fieberkurve) Ihren &amp;#196;nderungen
      gem&amp;#228;&amp;#223; dargestellt wird.<a href="#top">[nach oben]</a>

      <h3><a name="6">6. Der Mannschaftseditor</a></h3>

      <p>Hier k&amp;#246;nnen Sie die <strong>Mannschaftsnamen</strong>
      eingeben und &amp;#228;ndern, das <strong>K&amp;#252;rzel</strong> darf
      aus max. 5 Zeichen bestehen.

      <p>Falls der Verband Straf- bzw. Bonuspunkte und Tore vergeben sollte,
      kann man diese hier eintragen. Sie werden bei der Berechnung der Tabelle
      ber&amp;#252;cksichtigt. Man kann auch festlegen, dass die
      &amp;#196;nderung erst ab einem bestimmten Spieltag wirksam werden soll.

      <p>Falls Sie die Homepage der Mannschaften linken wollen, k&amp;#246;nnen
      Sie die entsprechenden URL in der n&amp;#228;chsten Spalte eintragen.
      Diese Links werden in der Tabelle angezeigt; aber nur, wenn die <a href=
      "#4">Einstellung</a> <strong>Mannschafts-Homepages verlinken</strong>
      aktiviert ist.

      <p class="attention">Es gibt zudem f&amp;#252;r jede Mannschaft eine
      Funktion, mit der eine <strong>Mannschaft aus der Liga
      zur&amp;#252;ckgezogen</strong> werden kann. Weiterhin kann man auch eine
      <strong>neue Mannschaft nachtr&amp;#228;glich zur Liga
      hinzuf&amp;#252;gen</strong>. <em>Legen Sie sich vor der Nutzung dieser
      Funktionen besser <a href="dateifunktionen.html#3">eine
      Sicherheitskopie</a> Ihrer Liga an!</em> Falls Sie das Tippspiel für
      diese Liga benutzen, führen diese Funktionen zu Fehlfunktionen im
      Tippspiel! Bei KO-Turnieren stehen diese Funktionen nicht zur
      Verf&amp;#252;gung.<a href="#top">[nach oben]</a>
    </div>

    <dl id="footer">
      <dt>© Liga Manager Online 2004/05
    </dl>
  </div>

