<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">

<title>Addons Tippspiel</title>
  <meta name="generator" content="Der Dirigent 01.00.01 / www.der-dirigent.de">
  <meta name="author" content="der dirigent">
  <meta name="robots" content="index, follow">
  <meta http-equiv="content-type" content="text/html; charset=iso-8859-1">
  <link rel="stylesheet" href="../../media/lmo.css" type="text/css">

<div id="container">
    <div id="header">
      <a href="http://www.liga-manager-online.de/"><img src=
      "../../media/logo_lmo.gif" alt="Liga Manager Online" width="492" height=
      "48" border="0"></a>
    </div>

    <div id="back">
       
    </div>

    <div id="urhere">
       
    </div>

    <div id="navi">
      <ul>
        <li id="flags"> 
      </ul>

      <div class="navigation">
        <ul>
          <li><a class="folder" href="../index.html">Hilfe</a>

          <li>
            <a class="active" href="index.html">Addons</a>

            <ul>
              <li><a class="active" href="tippspiel.html">Tippspiel</a>

              <li><a class="page" href="newsticker.html">Newsticker</a>

              <li><a class="page" href="minitabellen.html">Minitabellen</a>

              <li><a class="page" href=
              "spielerstatistik.html">Spielerstatistik</a>

              <li><a class="page" href="teamvergleich.html">Teamvergleich</a>

              <li><a class="page" href="viewer.html">Viewer</a>

              <li><a class="page" href="teamplan.html">Teamplan</a>
            </ul>
          </ul>
      </div>
    </div>

    <div id="content">
      <a name="top" id="top"></a>

      <h1>Tippspiel</h1>

      <ol>
        <li><a href="#eval">Auswertung</a>

        <li><a href="#newsletter">Newsletter/Reminder</a>

        <li><a href="#user">Userverwaltung</a>

        <li><a href="#option">Optionen</a>
      </ol>

      <p><img src="../../media/tippspiel01.png" alt="Tippeinsicht" width="441"
      height="256" align="right"> Im LMO 4 ist ein umfangreiches umd sehr
      flexibles Tippspiel integriert. Es basiert auf dem Tippspieladdon
      f&amp;#252;r den LMO 3 von Frank Albrecht.

      <h3><a name="eval" id="eval"></a>Auswertung</h3>

      <p>Hier werden die tippbaren Ligen ausgewertet, das hei&amp;#223;t jedem
      Tipper werden seine erreichten Punkten gutgeschrieben. Es kann jede Liga
      und jeder Spieltag einzeln gewertet werden, es ist aber auch
      m&amp;#246;glich alle Spieltage einer bestimmten Liga auszuwerten.

      <p>Falls mehrere Ligen getippt werden, kann auch die
      <strong>Gesamtwertung</strong> hier aktualisiert werden.

      <p>Ebenso k&amp;#246;nnen Sie hier die Tippeinsichten erstellen und
      aktualisieren. Damit k&amp;#246;nnen Ihre Mitspieler sehen, wie die
      Konkurrenten getippt haben, ja nach Einstellung in den <a href=
      "#4">Optionen</a> auch erst, nachdem der Spieltag abgelaufen ist.<a href=
      "#top">[nach oben]</a>

      <h3><a name="newsletter" id="newsletter">Newsletter/Reminder</a></h3>

      <p>Hier haben Sie die M&amp;#246;glichkeit, Ihren Tippern verschiedene
      Nachrichten zukommen zu lassen, einen <strong>Newsletter an alle
      Tipper</strong>, <strong>pers&amp;#246;nliche Mails</strong> an
      Mitspieler und einen <strong>Tippreminder</strong> , der die Tipper an
      ihre Tippabgabe erinnern soll.

      <p>Es gibt verschiedene Platzhalter, die beim Mailversand durch deren
      Entsprechnung ersetzt werden.

      <dl>
        <dt>[nick]

        <dd>Nickname des jeweiligen Tippers

        <dt>[pass]

        <dd>Nickname des jeweiligen Tippers

        <dt>[name]

        <dd>Der richtige Name des Tippers

        <dt>[spiele]

        <dd>Dieser Paltzhalter ist nur im Tippreminder aktiv, er listet alle zu
        tippenden Spiele im angegebenen Zeitraum auf.
      </dl><a href="#top">[nach oben]</a>

      <h3><a name="user" id="user">Userverwaltung</a></h3>

      <p>Hier verwalten Sie die Teilnehmer des Tippspiels, sie k&amp;#246;nnen
      selbst <strong>neue Tipper anlegen</strong>, <strong>Tipper
      editieren</strong> und <strong>Tipper l&amp;#246;schen</strong>.
      F&amp;#252;r jeden Tipper sind alle wichtigen Details &amp;#228;nderbar:

      <dl>
        <dt>Pers&amp;#246;nliche Daten

        <dd>Passwort, Namen, Adresse, Mail

        <dd>Ist der Tipper gesperrt/freigeschaltet?

        <dt>Mailabonnements

        <dd>Soll der Tipper den Newsletter oder den Reminder erhalten?

        <dt>Team

        <dd>In welchem Team spielt der Tipper? (nur bei aktivierter Teamoption)

        <dt>abonnierte Ligen

        <dd>Welche Ligen kann der Tipper tippen?
      </dl><a href="#top">[nach oben]</a>

      <h3><a name="option" id="option">Optionen</a></h3>

      <p>Die ist der umfangreichste und wichtigste Punkt des Tippspiels. Sie
      sollten die Optionen vor dem Start des Tippspiels einmal komplett
      einstellen und w&amp;#228;hrend des Tippspieles nicht mehr wesentlich
      ver&amp;#228;ndern.

      <dl>
        <dt>Tippmodus

        <dd>Hier w&amp;#228;hlen Sie, ob ein Ergebnis oder nur die Tendenz
        (gewonnen, unentschieden, verloren) getippt werden soll.

        <dt>Pfade

        <dd>Hier steht der Pfad, in dem das Tippspiel seine Daten speichert.
        Die Grundeinstellung ist <strong>/tipps</strong>. Diese sollten Sie
        nicht ohne guten Grund &amp;#228;ndern.

        <dt>Punkteverteilung

        <dd>Hier wird die Punktevergabe f&amp;#252;r das Tippspiel
        konfiguriert. Je nach Tippmodus sind unterschiedliche Einstellungen
        m&amp;#246;glich, im Tendenzmodus gibt es naturgem&amp;#228;&amp;#223;
        weniger Einstellungsm&amp;#246;glichkeiten.

        <dt>Anzeigen

        <dd>Die Punkte die hier aktiviert sind, werden beim Tippspiel in der
        Navigationsleiste angezeigt.

        <dt>Regeltechnisches

        <dd>Hier k&amp;#246;nnen Sie mehrere grundlegende Sachen f&amp;#252;r
        das Tippspiel einstellen. Sie k&amp;#246;nnen den
        <strong>Tippabgabeschluss</strong> konfigurieren, <strong>maximale
        Teamgr&amp;#246;&amp;#223;en</strong> festlegen und einstellen,
        wieviele <strong>Tage im Voraus</strong> getippt werden darf. Weiterhin
        k&amp;#246;nnen Sie hier den <strong>Jokertipp</strong> aktivieren,
        dabei haben die Tipper die M&amp;#246;glichkeit, ein Spiel pro Spieltag
        festzulegen, in dem ein Tipp mehr Punkte als normalerweise wert ist.
        Den entsprechenden <strong>Multiplikationsfaktor</strong>
        k&amp;#246;nnen Sie hier festlegen.

        <dt>Anmeldung

        <dd>Hier legen Sie die Anmeldemodalit&amp;#228;ten fest. Sie
        k&amp;#246;nnen bestimmen, welche <strong>Angaben</strong> die Tipper
        bei der Anmeldung f&amp;#252;r das Tippspiel machen m&amp;#252;ssen, ob
        die Tipper ihre <strong>Anmeldung per Mail</strong>
        vervollst&amp;#228;ndigen m&amp;#252;ssen (praktisch zur Verifizierung
        der angegebenen Mailadresse), ob Sie im Falle einer Neuanmeldung eine
        <strong>Benachrichtigung</strong> haben m&amp;#246;chten und ob neue
        Tipper erst von Ihnen <strong>freigeschaltet</strong> werden
        m&amp;#252;ssen.

        <dt>Tippabgabe

        <dd>Hier konfigurieren Sie das Aussehen der Tippabgabe. Im
        Ergebnismodus k&amp;#246;nnen Sie <strong>Pfeile</strong> anzeigen
        lassen, um das Ergebnis &amp;#228;hnlich wie im Ergebniseditor ohne
        Tastatur einstellen zu k&amp;#246;nnen. Um dem Tipper Anhaltspunkte
        &amp;#252;ber bereits erfolgte Tipps zu geben, k&amp;#246;nnen Sie hier
        die bereits <strong>getippten Tendenzen</strong> und
        <strong>Durchschnittstipps</strong> anzeigen lassen.

        <dd class="attention">Es gibt zwei M&amp;#246;glichkeiten, wie die
        Tipper ihre Tipps abgeben k&amp;#246;nnen, <strong>Ligenweise</strong>
        oder <strong>Datumsweise</strong>. Bei der ersten Variante wird pro
        Liga und pro Spieltag getippt, die zweite Variante gruppiert alle
        Spiele (auch mehrerer Ligen), die innerhalb des angegebenen Zeitraums
        stattfinden. <em>Falls Sie beide Varianten deaktivieren, ist keine
        Tippabgabe m&amp;#246;glich.</em>

        <dd>Zus&amp;#228;tzlich k&amp;#246;nnen Sie hier einstellen, ob bei der
        Tippabgabe eine <strong>automatische Aktualisierung der
        Tippeinsichten</strong> stattfinden soll.

        <dt>Tippeinsicht

        <dd>Hier stellen Sie ein, wann die Tippeinsicht angezeigt werden soll.
        Entweder sofort nach der Eingabe des Tipps, nach Tippabgabeschluss oder
        erst nach der Eingabe der Ergebnisse. Weiterhin bestimmen Sie hier,
        wieviele Tipper auf einer Seite der Tippeinsicht dargestellt werden
        sollen.

        <dt>Tipp-Tabelle

        <dd>An Hand der Tipps der User errechnet das Tippspiel eine Tabelle
        f&amp;#252;r jeden User. Hier besteht die M&amp;#246;glichkeit eine
        Tipp-Tabelle aller User oder eine Tipp-Tabelle nach eingebrachten
        Punkten zu ver&amp;#246;ffentlichen.

        <dt>Punktestandtabellen

        <dd>Hier konfigurieren Sie das Aussehen der Punktestandsanzeige. Sie
        k&amp;#246;nnen entweder nur die Gesamtwertung anzeigen lassen (falls
        Sie eine Gesamtwertung f&amp;#252;hren) oder auch zus&amp;#228;tzlich
        dazu f&amp;#252;r jede Liga eine einzelne Wertung. Weiterhin
        k&amp;#246;nnen Sie bestimmen, welche pers&amp;#246;nlichen Daten Ihrer
        Tipper Sie hier ver&amp;#246;ffentlichen wollen. Dazu z&amp;#228;hlen
        die Anzeige des Realnamens, des Nicknamens und/oder der Mailadresse.
        Zus&amp;#228;tzlich bestimmen Sie hier, wie ausf&amp;#252;hrlich die
        Aufschl&amp;#252;sselung der erreichten Punkte angezeigt werden soll.

        <dt>Was z&amp;#228;hlt bei Punktgleichheit?

        <dd>Hier haben Sie die M&amp;#246;glichkeit, so genannte Tie-Breaker zu
        setzen. Wenn also zwei Tipper punktgleich sind, k&amp;#246;nnen Sie
        hier drei weitere Kriterien angeben, nach denen in absteigender
        Reihenfolge entschieden wird.

        <dt>Zus&amp;#228;tzliche Auswertungen

        <dd class="attention">Hier stellen Sie ein, was bei der Eingabe der
        Ligaergebnisse f&amp;#252;r das Tippspiel zus&amp;#228;tzlich
        ausgewertet werden soll. Bei Aktivierung dieser Punkte ist die manuelle
        Aktualisierung nicht mehr n&amp;#246;tig, bei sehr vielen Mitspielern
        kann es allerding zu Problemen mit der Laufzeit kommen, da dieser
        Schritt sehr rechenintensiv ist.

        <dt>Tippbare Ligen

        <dd>Hier geben Sie die Ligen frei, welche von den Tippern abonniert
        werden k&amp;#246;nnen. Sie haben die M&amp;#246;glichkeit, alle
        vorhandenen Ligen freizugeben oder nur einzelne Ligen. <em>Nur Ligen,
        die freigegeben sind, k&amp;#246;nnen von den Mitspielern getippt
        werden.</em>
      </dl><a href="#top">[nach oben]</a>
    </div>

    <dl id="footer">
      <dt>© Liga Manager Online 2004/05
    </dl>
  </div>

